testCases/crashingCases/smallMesh/constant/pyrolysisProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      pyrolysisProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

//constant burning rate (kg/m2/s)
m0      m0   [ 1 -2 -1 0 0 0 0] 0;

// Solid and gas specie names
solidName  EMs;
gasName    EMg;

// Pyrolysis Model Selection
pyrolysisModel    NoPyrolysis;

// ************************************************************************* //
